[
    {
        "TypeID": 1,
        "TypeName": "ESFJ",
        "TypeDescription": "ESFJها که اغلب با عنوان \"حامی\" یا \"مشاور\" شناخته می‌شوند، افرادی بسیار اجتماعی، وظیفه‌شناس و دلسوز هستند. آن‌ها به طور طبیعی به نیازهای دیگران توجه می‌کنند و شادی خود را در کمک عملی به دیگران و حفظ هارمونی و نظم در محیط اطرافشان می‌بینند.\n\nآن‌ها در رعایت آداب اجتماعی و برقراری ارتباطات گرم مهارت دارند و اغلب به عنوان ستون‌های اصلی خانواده‌ها یا گروه‌های اجتماعی عمل می‌کنند. ESFJها به سنت‌ها و روال‌ها اهمیت می‌دهند و تلاش زیادی می‌کنند تا اطمینان حاصل کنند که همه چیز سازمان‌دهی شده، پایدار و دلپذیر باشد. آن‌ها نیاز به قدردانی و تایید دارند و ممکن است نسبت به انتقاد بسیار حساس باشند."
    },
    {
        "TypeID": 2,
        "TypeName": "ISFJ",
        "TypeDescription": "ISFJها که اغلب با عنوان \"مدافع\" یا \"محافظ\" شناخته می‌شوند، افرادی آرام، متعهد و صمیمی هستند که عمیقاً به دیگران اهمیت می‌دهند. آن‌ها ترکیبی منحصر به فرد از وظیفه‌شناسی و دلسوزی عملی هستند.\n\nISFJها به دلیل توجه فوق‌العاده‌شان به جزئیات و داشتن حافظه‌ای قوی برای افراد مهم زندگی‌شان، شناخته می‌شوند. آن‌ها دوست دارند در پشت صحنه کار کنند و با پشتکار و وفاداری به تعهدات خود عمل می‌کنند تا اطمینان حاصل کنند که نیازهای عزیزان و سازمان‌های مورد علاقه‌شان به بهترین شکل برآورده می‌شود. آن‌ها به دنبال نظم، ثبات و هماهنگی هستند و اغلب از تغییرات ناگهانی استقبال نمی‌کنند."
    },
    {
        "TypeID": 3,
        "TypeName": "ESFP",
        "TypeDescription": "ESFPها که اغلب با نام \"هنرمند\" یا \"مجری\" شناخته می‌شوند، افرادی سرزنده، شوخ‌طبع و مشتاق زندگی هستند. آن‌ها \"روح مهمانی\" هستند و به دلیل انرژی مسری و توانایی‌شان در لذت بردن از لحظه حال، شناخته می‌شوند.\n\nاین تیپ شخصیتی به شدت بر لحظه حال تمرکز دارد و از طریق حواس پنجگانه خود با جهان درگیر می‌شود. ESFPها عاشق تجربیات جدید، هیجان، و محیط‌های اجتماعی هستند. آن‌ها بسیار مشاهده‌گر هستند، به سرعت حال و هوای یک اتاق را می‌خوانند و می‌توانند به طور خودانگیخته با نیازهای عاطفی دیگران سازگار شوند. برای آن‌ها، زندگی به معنی عمل، زیبایی و به اشتراک گذاشتن شادی با دوستان و عزیزانشان است. آن‌ها اغلب از روش‌های یادگیری عملی و پروژه‌هایی که نتیجه ملموس و فوری دارند، لذت می‌برند."
    },
    {
        "TypeID": 4,
        "TypeName": "ISFP",
        "TypeDescription": "ISFPها که اغلب با نام \"ماجراجو\" یا \"هنرمند\" شناخته می‌شوند، افرادی آرام، حساس و مهربان هستند. آن‌ها با حس عمیقی از زیبایی‌شناسی زندگی می‌کنند و اغلب از طریق کارهای عملی یا هنری خود را ابراز می‌کنند.\n\nISFPها زندگی را یک بوم نقاشی برای ابراز وجود می‌دانند. آن‌ها به شدت با لحظه حال درگیر هستند، به شدت به محیط اطراف خود آگاهند و به جزئیاتی توجه می‌کنند که دیگران از آن غافلند (مانند رنگ‌ها، بوها و صداها). تصمیمات آن‌ها عمیقاً ریشه در نظام ارزش‌های درونی آن‌ها دارد، که اغلب به دلیل طبیعت ساکتشان، برای دیگران پنهان می‌ماند. آن‌ها خواهان استقلال و انعطاف‌پذیری در زندگی هستند و از قوانین سفت و سخت بیزارند. با وجود اینکه درونگرا هستند، به افرادی که برایشان مهم‌اند، وفادار و حامی هستند و محبت خود را بیشتر از طریق عمل نشان می‌دهند تا کلمات."
    },
    {
        "TypeID": 5,
        "TypeName": "ENFJ",
        "TypeDescription": "ENFJها که اغلب با نام \"قهرمان\" یا \"پروتاگونیست\" شناخته می‌شوند، رهبرانی کاریزماتیک، آرمان‌گرا و همدل هستند. آن‌ها با اشتیاقی عمیق برای کمک به دیگران و ایجاد تغییر مثبت در جهان برانگیخته می‌شوند.\n\nENFJها افرادی اجتماعی و رک هستند که مهارت‌های ارتباطی قوی دارند. آن‌ها به طور ذاتی توانایی درک احساسات و انگیزه‌های دیگران را دارند (عملکرد برون‌گرای احساسی قوی). این توانایی آن‌ها را به مشوق‌هایی عالی تبدیل می‌کند که پتانسیل رشد را در دیگران می‌بینند و از آن‌ها برای رسیدن به اهدافشان حمایت و الهام می‌بخشند.\n\nENFJها آینده‌نگر هستند و دوست دارند برای رسیدن به اهداف بزرگ خود و کمک به جامعه، برنامه‌ریزی و سازماندهی کنند. آن‌ها در نقش‌های رهبری که شامل هماهنگی و حل اختلاف است، پیشرفت می‌کنند و همیشه در تلاشند تا در روابط خود هماهنگی و سازگاری ایجاد کنند. آرمان‌گرایی و تمایل آن‌ها به قرار دادن نیازهای دیگران قبل از نیازهای خود، ویژگی بارز این تیپ است."
    },
    {
        "TypeID": 6,
        "TypeName": "INFJ",
        "TypeDescription": "INFJ، که به عنوان «حامی» شناخته می‌شود، نادرترین تیپ شخصیتی است؛ آن‌ها آرمان‌گرایانی با بصیرت و عمیقاً همدل هستند که با تکیه بر ارزش‌های قوی خود و روشی منظم، به دنبال درک و الهام بخشیدن به دیگران برای ایجاد تغییرات مثبت و معنی‌دار در جهان هستند."
    },
    {
        "TypeID": 7,
        "TypeName": "ENTP",
        "TypeDescription": "ENTPها افراد باهوش، کنجکاو، خلاق و با اعتماد به نفس هستند که با چابکی ذهنی و شوخ‌طبعی شناخته می‌شوند. آن‌ها عاشق ایده‌های جدید، نوآوری و حل خلاقانه مسائل پیچیده هستند و اغلب به خاطر علاقه زیادشان به بحث و جدل‌های فکری (که گاهی اوقات نقش \"وکیل مدافع شیطان\" را بازی می‌کنند) معروفند"
    },
    {
        "TypeID": 8,
        "TypeName": "INTP",
        "TypeDescription": "INTPها اساساً مخترعان و فیلسوفان دنیای شخصیت‌ها هستند. ذهن آن‌ها مانند یک آزمایشگاه بزرگ است که دائماً در حال ساخت، تجزیه و تحلیل و بازسازی نظریه‌ها است."
    },
    {
        "TypeID": 9,
        "TypeName": "ENFP",
        "TypeDescription": "ENFPها افرادی مشتاق، کاریزماتیک و خلاق هستند که از کشف ایده‌های جدید و ایجاد ارتباطات عمیق و معنادار با دیگران لذت می‌برند. آن‌ها روحیه آزادی دارند و الهام‌بخش اطرافیان خود هستند."
    },
    {
        "TypeID": 10,
        "TypeName": "INFP",
        "TypeDescription": "INFPها افرادی آرام، ایده‌آل‌گرا و همدل هستند که دنیای درونی غنی و پرشوری دارند. آن‌ها عمیقاً به ارزش‌های شخصی خود متعهدند و انگیزه دارند تا دنیا را به مکانی بهتر تبدیل کنند، اغلب از طریق خلاقیت و کمک به دیگران."
    },
    {
        "TypeID": 11,
        "TypeName": "ENTJ",
        "TypeDescription": "ENTJها رهبرانی بالفطره، قاطع و استراتژیک هستند که اغلب با نام \"فرمانده\" شناخته می‌شوند. آن‌ها دارای کاریزما و اعتماد به نفس بالایی هستند و هدف اصلی‌شان این است که با برنامه‌ریزی بلندمدت و منظم، دنیا را به شکل مؤثرتر و کارآمدتری سازماندهی کنند. ENTJها متفکرانی آینده‌نگر و منطقی هستند که به سرعت موقعیت‌ها را تحلیل کرده، برای رسیدن به اهداف بزرگ تصمیمات دشوار می‌گیرند و دیگران را با قاطعیت و وضوح خود به سمت یک هدف مشترک هدایت می‌کنند. آن‌ها از ناکارآمدی و ابهام بیزارند و به شدت هدف‌گرا هستند."
    },
    {
        "TypeID": 12,
        "TypeName": "INTJ",
        "TypeDescription": "INTJها متفکرانی استراتژیک، تحلیلی و مستقل هستند که اغلب با نام \"معمار\" شناخته می‌شوند. آن‌ها ایده‌های خلاقانه و بلندمدت را با یک رویکرد منطقی و ساختارمند پیاده‌سازی می‌کنند. آن‌ها برای شایستگی، دانش و اثربخشی ارزش قائلند، ترجیح می‌دهند به‌تنهایی کار کنند و استانداردهای بالایی برای خود و دیگران دارند."
    },
    {
        "TypeID": 13,
        "TypeName": "ESTJ",
        "TypeDescription": "ESTJها رهبرانی عملگرا، منظم و سخت‌کوش هستند که اغلب با نام \"مجری\" یا \"مدیر\" شناخته می‌شوند. آن‌ها به شدت به نظم، سنت و قوانین اهمیت می‌دهند. این تیپ شخصیتی در سازماندهی افراد و پروژه‌ها برای دستیابی به اهداف مشخص، بسیار توانا و قابل اعتماد است و ترجیح می‌دهد کارها را به صورت سیستماتیک و مطابق با رویه‌های اثبات‌شده پیش ببرد."
    },
    {
        "TypeID": 14,
        "TypeName": "ISTJ",
        "TypeDescription": "ISTJها آرام، متعهد و بسیار مسئولیت‌پذیر هستند که اغلب با نام \"تدارکاتچی\" یا \"بازرس\" شناخته می‌شوند. آن‌ها به شدت به وظیفه، ثبات و سنت‌ها اهمیت می‌دهند. این تیپ شخصیتی با تکیه بر حقایق، منطق و توجه دقیق به جزئیات، با پشتکار برای انجام تعهدات خود تلاش می‌کند و در محیط‌هایی که ساختار، قوانین مشخص و انتظار بالایی از دقت وجود دارد، عملکرد بسیار خوبی دارد. آن‌ها در عمل وفادار و قابل اعتماد هستند."
    },
    {
        "TypeID": 15,
        "TypeName": "ESTP",
        "TypeDescription": "ESTPها جسور، باهوش و عمل‌گرا هستند که اغلب با نام \"کارآفرین\" یا \"متقاعدکننده\" شناخته می‌شوند. آن‌ها در لحظه زندگی می‌کنند، عاشق هیجان، ریسک و حل عملی مشکلات هستند. این تیپ شخصیتی به نئوری‌ها و برنامه‌ریزی‌های طولانی‌مدت علاقه چندانی ندارد، در عوض، با انرژی و کاریزمای خود، به سرعت وارد عمل می‌شود و می‌تواند با هوش و ذکاوت خود، هر موقعیتی را به نفع خود تغییر دهد. آن‌ها در تعاملات اجتماعی بسیار ماهر و قانع‌کننده هستند."
    },
    {
        "TypeID": 16,
        "TypeName": "ISTP",
        "TypeDescription": "ISTPها مشاهده‌گرانی آرام اما ماهر و عمل‌گرا هستند که اغلب با نام \"زبردست\" یا \"مجری\" شناخته می‌شوند. آن‌ها با منطق عینی و کنجکاوی، به دنبال درک این هستند که چیزها چگونه کار می‌کنند و با مهارت‌های فنی خود، به سرعت و کارآمدی مشکلات را حل می‌کنند. ISTPها مستقل، ریسک‌پذیر و خونسرد هستند و ترجیح می‌دهند به جای تئوری‌پردازی، با دست‌های خود به کار بپردازند و از طریق آزمون و خطا یاد بگیرند. آن‌ها در بحران‌ها کاملاً آرام و متمرکز باقی می‌مانند."
    }
]